
## Plan Result (prd)

[CI link](https://github.com/fumi-mura/tfaction-sample/actions/runs/16452653458)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.foo


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.foo will be created
  + resource "aws_cloudwatch_log_group" "foo" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "foo"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Env"                = "prd"
          + "ManagedByTerraform" = "true"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":12,"Program":"tfcmt","SHA1":"9c0d1d0e8b66e5c7cf94dff3dd1d251fd1f489ac","Target":"prd","Vars":{},"WorkflowName":"Terraform plan"} -->